Repository: SamerW/Verifiable-Credentials-Policy
Catalog: module/translations/*/LC_MESSAGES/messages.po
Languages: de, fr, pt

source: Profile with name {profile_name} already exists.
de: Profilname mit dem Namen {profile_name} existiert bereits
pt: Um perfil com o nome {profile_name} já existe.

source: Unknown Error
de: Unbekannter Fehler
fr: Erreur inconnu
pt: Erro Desconhecido

source: Profile created
de: Profil erstellt
fr: Profil créé
pt: Perfil criado

source: Please fill all parameters
de: Bitte alle Parameter ausfüllen
fr: Veuillez remplir tous les paramètres
pt: Por favor, preencha todos os parâmetros

source: Profile not updated: A profile with this name already exists
de: Profil nicht aktualisiert: Ein Profil mit diesem Namen existiert bereits
fr: Impossible de mettre à jour le profil: un profil avec le même nom existe déjà

source: Could not update profile
de: Profil konnte nicht aktualisiert werden
pt: Não foi possível atualizar o perfil

source: Profile updated
de: Profil aktualisiert
fr: Profil mis à jour
pt: Perfil atualizado

source: Delete
de: Löschen
fr: Supprimer
pt: Excluir

source: Error - Profile can't be deleted
de: Fehler - Profil kann nicht gelöscht werden
fr: Erreur - Le profil n'a pas pu être supprimé
pt: Erro - O perfil não pode ser excluído

source: Profile deleted
de: Profil gelöscht
fr: Profil supprimé
pt: Perfil excluído

source: A {name} credential must :<br>
de: Ein {name} Berechtigungsnachweis muss :<br>
pt: Uma credencial {name} deve :<br>

source: <div style="margin-left: 40px">• be issued by {issuer}<br></div>
de: <div style="margin-left: 40px">• wird ausgestellt von {issuer}<br></div>
pt: <div style="margin-left: 40px">• ser emitida por {issuer}<br></div>

source: <div style="margin-left: 40px">• be of type {type}<br></div>
de: <div style="margin-left: 40px">• ist von der Art {type}<br></div>
pt: <div style="margin-left: 40px">• ser do tipo {type}<br>

source: Statement with name "{property_name}" already exists.
de: Anweisung mit dem Namen "{property_name}" existiert bereits.
pt: Já existe uma declaração com o nome "{property_name}".

source: Selective Disclosure Statement created
de: Selective Disclosure Statement erstellt
fr: La déclaration a été créée.
pt: Uma declaração do tipo Divulgação Seletiva (SD) foi criada

source: Statement not updated: A statement with this name already exists
de: Anweisung nicht aktualisiert: Eine Anweisung mit diesem Namen existiert bereits

source: Statement "{statement_name}" updated
de: Anweisung "{statement_name}" aktualisiert
pt: Declaração "{statement_name}" atualizada

source: Error: Statement "{statement_name}" could not be updated
de: Fehler: Anweisung "{statement_name}" konnte nicht aktualisiert werden
pt: Erro: A declaração "{statement_name}" não pode ser atualizada

source: Statement deleted
de: Anweisung gelöscht
fr: Déclaration supprimée
pt: Declaração excluída

source: {sdName} requires :<br>
de: {sdName} erfordert :<br>
pt: {sdName} requer :<br>

source: either
de: entweder
fr: soit
pt: ou

source: Get Policy in Json
de: Richtlinie in Json abrufen
fr: Récuperer la politique en Json
pt: Pegar Política no formato Json

source: Error - Policy can't be deleted
de: Fehler - Richtlinie kann nicht gelöscht werden
fr: Erreur - La politique n'a pas pu être supprimée
pt: Erro - A política não pode ser excluída

source: Policy deleted
de: Richtlinie gelöscht
pt: Política excluída

source: or
de: oder
fr: ou
pt: ou

source: ) and
de: und
pt: ) e

source: )or(
de: oder
pt: )ou(

source: Policy updated
de: Richtlinie aktualisiert
fr: Politique mise à jour
pt: Política atualizada

source: In order to
de: Um zu
fr: Afin de
pt: Para

source: you must present
de: Sie müssen präsentieren
pt: você deve apresentar

source: for
de: für
pt: para

source: from a
de: vom
fr: venant de
pt: de um

source: or
de: oder
fr: ou
pt: ou

source: and
de: und
pt: e

source: you must present either (
de: Sie müssen entweder( präsentieren
fr: Vous devez présenter soit (
pt: você deve apresentar ou (

source: being
de: sein
fr: étant
pt: sendo

source: and for
de: und für
pt: e para

source: ) or (
de: ) oder (
fr: ) ou (
pt: ) ou (

source: Error - Schema can't be deleted
de: Fehler - Schema kann nicht gelöscht werden

source: Schema is used in Profile(s) or Statement(s), it can't be deleted
de: Schema wird in Profil(en) oder Anweisung(en) verwendet, es kann nicht gelöscht werden
fr: Le schéma est utilisé dans des profiles ou des déclarations, il ne peux pas être supprimé

source: Schema deleted
de: Schema gelöscht

source: Replace
de: Ersetze
fr: Remplacer

source: Schema's issuer: "{schema_issuer}"<br>
de: Schema's ausgeber: "{schema_issuer}"<br>
fr: Emetteur du schéma: "{schema_issuer}"<br>

source: Schema's type: "{schema_type}"<br>
de: Schema's Typ: "{schema_type}"<br>
fr: Type du schéma: "{schema_type}"<br>

source: Schema's properties:<br>
de: Die Eigenschaften des Schemas:<br>
fr: Propriétés du schéma:<br>

source: please select an option
de: Bitte wählen Sie eine Option
fr: veuillez choisir une option
pt: por favor, escolha uma opção

source: Enter your name for property selection
de: Geben Sie Ihren Namen für die Eigenschaftsauswahl ein
fr: Entrer le nom de la déclaration
pt: Entre um nome para a seleção de propriedades

source: requires
de: erfordert
fr: nécessite
pt: requer

source: List of properties
de: Liste der Eigenschaften
fr: Liste des propriétés
pt: Lista de propriedades

source: from a
de: von einer
fr: venant de
pt: de um

source: List of credential profiles
de: Liste der Berechtigungsprofile
pt: Lista de perfies de credenciais

source: and, ), or
de: und, ) , or
fr: et, ), ou
pt: e, ), ou

source: and
de: und
fr: et
pt: e

source: Policy already exists
de: Richtlinie existiert bereits
fr: Cette politique existe déjà
pt: A política já existe

source: Json Error
de: Json Fehler
fr: Erreur Json
pt: Erro no Json

source: Policy with PolicyMatchId {policy_match_id} doesn't exist
de: Richtlinie mit PolicyMatchId {policy_match_id} existiert nicht
pt: A política com o PolicyMatchId {policy_match_id} não foi encontrada

source: Policy with id {policy_id} doesn't exist
de: Richtlinie mit id {policy_id} existiert nicht
pt: A política com id {policy_id} não foi encontrada

source: VC Profile with id {profile_id} doesn't exist
de: VC Profil mit id {profile_id} existiert nicht
pt: O perfil de VC com id {profile_id} não foi encontrado

source: VC Profile with id {profile_id} deleted
de: VC Profil with id {profile_id} wurde gelöscht
pt: O perfil de VC com id {profile_id} foi excluído

source: Schema "{schema_name}" already exist
de: Schema "{schema_name}" existiert bereits

source: Schema "{type_name}" already exist
de: Schema "{type_name}" existiert bereits

source: Schema "{type_name}" uploaded
de: hochgeladen

source: Schema not valid
de: Schema nicht gültig
fr: Le schéma n'est pas valide

source: Can't replace schema: schema "{type_name}" doesn't exist
de: Schema kann nicht ersetzt werden: schema "{type_name}" existiert nicht

source: Can't replace schema: Some properties you want to replace are used in profiles or statements
de: Das Schema kann nicht ersetzt werden: Einige Eigenschaften, die Sie ersetzen möchten, werden verwendet in Profile oder Angaben
fr: Impossible de remplacer le schéma: Certaines propriétés que vous voulez remplacer sont utilisés dans des profils ou des déclarations

source: Can't replace schema: The issuer in the old schema is used in some profiles
de: Das Schema kann nicht ersetzt werden: Der Aussteller im alten Schema wird in einigenProfile
fr: Impossible de remplacer le schéma: L'émetteur de l'ancien schéma est utilisé dans des profils

source: Schema "{type_name}" replaced
de: Schema "{type_name}" ersetzt

source: Schema with id {schema_id} deleted
de: Schema mit dem id {schema_id} gelöscht

source: Schema with id {schema_id} doesn't exist
de: Schema mit dem id {schema_id} existiert nicht

source: Sd Statement with id {statement_id} doesn't exist
de: Sd Anweisung mit id {statement_id} existiert nicht
pt: A declaração SD com id {statement_id} não foi encontrada

source: Sd Statement with id {statement_id} deleted
de: Sd Anweisung mit id {statement_id} wurde gelöscht
pt: A declaração SD com id {statement_id} não foi encontrada

source: Home
de: Startseite
fr: Accueil
pt: Menu Principal

source: Credential Profile
de: Berechtigungsprofil
fr: Profil de certificat
pt: Perfil de Credencial

source: Property Selection
de: Auswahl der Eigenschaft
fr: Déclaration de divulgation
pt: Escolha de Propriedades

source: Policy
de: Richtlinie
fr: Politique
pt: Política

source: Upload Schema
de: Schema hochladen
fr: Téléverser des schémas
pt: Enviar Esquema

source: A VC profile contains the filtering criteria that are needed to select a VC from the VC Holder’s wallet
de: Ein VC-Profil enthält die Filterkriterien, die zur Auswahl eines VC aus der Geldbörse des VC-Inhabers
fr: Un profil de certificat contient les critères nécéssaires à la sélection d'un certificat par le propriétaire d'un portefeuille
pt: Um perfil VC contém os critérios de filtragem necessários para selecionar um VC da carteira do Portador de VC

source: Create new profile
de: Neues Profil erstellen
fr: Créer un nouveau profil
pt: Criar novo perfil

source: Manage existing profiles
de: vorhandene Profile verwalten
fr: Gérer les profils existants
pt: Gerenciar perfis existentes

source: Enter your name for a credential profile
de: Geben Sie Ihren Namen für ein Berechtigungsprofil ein
fr: Entrer le nom du profil
pt: Entre o nome para o perfil de credencial

source: credential must:
de: Berechtigung muss:
fr: doit
pt: credencial deve:

source: be issued by
de: ausgestellt werden von
fr: être émis par
pt: ser emitida por

source: List of issuers
de: Liste der Emittenten
fr: Liste d'émetteurs
pt: Lista de emissores

source: be of type
de: vom Typ sein
fr: être de type
pt: ser do tipo

source: List of credential types
de: Liste der Berechtigungstypen
fr: Liste de types de certificat
pt: Lista de tipos de credenciais

source: Submit
de: Einreichen
fr: Soumettre
pt: Submeter

source: OR
de: ODER
fr: OU
pt: OU

source: Select a profile:
de: Profil wählen:
fr: Choisir un profil
pt: Selecionar um perfil:

source: Search for
de: Suchen nach
fr: Rechercher
pt: Buscar por

source: in a profile
de: in einem Profil
fr: dans un profil
pt: em um perfil

source: Modify
de: Ändern
fr: Modifier
pt: Modificar

source: Update
de: Aktualisieren
fr: Mettre à jour
pt: Atualizar

source: A policy says which properties you want from a user's credentials in order for the user to perform a particular task (i.e. action on a resource).)
de: Eine Richtlinie gibt an, welche Eigenschaften Sie von den Anmeldedaten eines Benutzers in damit der Benutzer eine bestimmte Aufgabe ausführen kann (d. h. eine Aktion auf einemRessource).)
fr: Une politique énonce les propriétés que vous voulez obtenir dans l'accréditation de l'utilisateur afin que cet utilisateur puisse effectuer une certaine tache (par exemple une action sur une ressource)

source: The policy is built by combining a series of And and Or statements, using the Profiles and SD Statements you have already created. If the user can submit alternative sets of credentials, start with 'either'. If the user must submit a single set of credentials start with 'blank'.)
de: Die Richtlinie wird durch die Kombination einer Reihe von Und- und Oder-Anweisungen erstellt, indem die Profile und SD-Anweisungen, die Sie bereits erstellt haben. Wenn der Benutzer alternative Sätze von Anmeldeinformationen einreichen kann, beginnen Sie mit 'either'. Wenn der Benutzer einen einzigen Satz von Anmeldeinformationen einreichen muss, beginnen Sie mit 'blank'.)
fr: La politique est construite sur une combinaison de séries de déclarations de Et et de Ou, utilisant les profiles et les déclarations que vous avez déjà créées.Si l'utilisateur peut soumettre différentes possibilités d'ensembles d'accréditation, commencez avec 'soit'. Si l'utilisateur doit soumettre un seul ensemble d'accrédation, commencez avec 'vide'

source: For each credential in a set, the user can choose between alternative sources e.g. a credit card number from a visa card or a mastercard, or their name and address from a gas bill or an electricity bill.)
de: Für jeden Berechtigungsnachweis in einem Satz kann der Benutzer zwischen alternativen Quellen, z. B. eine Kreditkartennummer von einer Visa-Karte oder einer Mastercard, oderSie können ihren Namen und ihre Adresse von einer Gasrechnung oder einer Stromrechnung ablesen.)
fr: Pour chaque accréditation dans un ensemble, l'utilisateur peut choisir entre plusieurs choix de source comme (par exemple une numéro de carte de crédi venant d'une carte Visa ou d'une Mastercardou leur nom et adresse venant d'une facture de gaz ou d'électricité.)

source: An example policy comprising a single set of credentials is:)
de: Eine Beispielrichtlinie, die einen einzelnen Satz von Anmeldeinformationen umfasst, lautet:)
fr: Exemple de politique ne comprenant qu'un seul ensemble d'accréditations:

source: In order to purchase car parking permit you must present for Credit card number ( Visa number from a Visa card or Mastercard number from a Mastercard or Amex number from a Amex card ) and for Car details ( car registration number from a car ownership ) and for Name and address ( name and address from a gas bill or name and address from a electricity bill )
de: Um einen Parkausweis zu erwerben, müssen Sie eine Kreditkartennummer Nummer ( Visa-Nummer von einer Visa-Karte oder Mastercard-Nummer von einer Mastercard oder Amex-Nummer von einer Amex-Karte ) und für Autodetails ( Auto Zulassungsnummer aus einem Autobesitz ) und für Name und Adresse ( Name und Adresse aus einer Gasrechnung oder Name und Adresse aus einer Strom Rechnung )
fr: Afin d'acheter un permis de stationnement de voiture, vous devez présent pour le numéro de carte de crédit (un numéro Visa venant d'une carte Visa ou un numéro Mastercard venant d'une Mastercard ou un numéro Amex venant d'une carte Amex ) et pour les détails de la voiture (un numéro d'enregistrement de voiture venant du propriétaire de la voiture) et pour le nom et adresse ( nom et adresse venant d'une facture de gaz ou nom et adresse venant d'une facture d'électricité)

source: Create new Policy
de: Neue Richtlinie erstellen
fr: Créer une nouvelle politique
pt: Criar nova Política

source: Manage existing Policies
de: Vorhandene Richtlinien verwalten
fr: Gérer les politiques existantes
pt: Gerenciar Políticas existentes

source: In order to
de: Um die
fr: Afin de
pt: Para

source: perform this action
de: diese Aktion durchführen
fr: effectuer cette action
pt: realizar esta ação

source: on this resource
de: auf diese Ressource
fr: sur cette resource
pt: neste recurso

source: users must present
de: Die Benutzer müssen vorlegen
fr: Les utilisateurs doivent présenter
pt: usuários devem apresentar

source: either or blank
de: entweder oder leer
fr: soit ou vide
pt: ou em branco

source: (blank)
de: (leer)
fr: (vide)
pt: (em branco)

source: for
de: für
fr: pour
pt: para

source: Purpose of this specific credential
de: Zweck dieser speziellen Bescheinigung
fr: But de cette accréditation
pt: Motivo desta credencial específica

source: List of statements
de: Liste der Anweisungen
fr: Liste des déclarations
pt: Lista de declarações

source: List of profiles
de: Liste der Profile
pt: Lista de perfis

source: Enter description
de: Beschreibung eingeben
fr: Entrer la description
pt: Entre uma descrição

source: being
de: sein
fr: étant
pt: sendo

source: or / blank
de: oder / leer
fr: ou / vide
pt: ou / em branco

source: blank
de: leer
fr: vide
pt: em branco

source: Select a Policy:
de: Richtlinie wählen
fr: Sélectionner une politique
pt: Escolha uma Política:

source: in a Policy
de: in einer Richtlinie
fr: dans une politique
pt: numa Política

source: Enter purpose
de: Zweck eingeben
fr: Entrer le but
pt: Entre um motivo

source: A Selective Disclosure Statement tells the VC Holder which properties of the VC should be returned to the verifier
de: Ein Selective Disclosure Statement teilt dem VC-Inhaber mit, welche Eigenschaften von die VC sollte an die Prüfstelle zurückgegeben werden
fr: Une déclaration SD liste les propriétés d'un certificat qui doivent être retournées au vérificateur
pt: Uma declaração de Divulgação Seletiva (SD) diz ao Portador de VC quais propriedades daVC devem ser retornadas ao verificador

source: Create new Sd Statement
de: Neues Sd-Statement erstellen
fr: Créer une nouvelle déclaration
pt: Criar nova Declaração SD

source: Manage existing Sd Statements
de: Vorhandene Sd-Anweisungen verwalten
fr: Gérer les déclarations existantes
pt: Gerenciar declarações SD existentes

source: in a Sd Statement
de: Wählen Sie eine Sd-Anweisung aus:
fr: dans une déclaration
pt: em uma Declaração SD

source: Upload new Schema
de: Neues Schema hochladen

source: Manage existing Schemas
de: Vorhandene Schemas verwalten

source: Select a Schema:
de: Schema wählen

source: in a Schema
de: in einem Schema
fr: dans un schéma

source: Replace Schema
de: Schema ersetzen

source: Choose a json schema file:
de: Wählen Sie eine json-Schemadatei
fr: Choisir un schema json
pt: Escolha um arquivo de esquema json

source: Enter the url of the schema to fetch:
de: Geben Sie die URL des abzurufenden Schemas ein:
fr: Entrer l'url du schema a récupérer
pt: Entre a url do esquema para recuperar:

source: url of the schema
de: URL des Schemas
fr: url du schema
pt: url do esquema

source: Extract nested properties:
de: Verschachtelte Eigenschaften extrahieren:
fr: Extraire les propriétés imbriquées
pt: Extrair propriedades aninhadas

source: A
fr: Un
pt: Um

source: )and / or / )
fr: )et / ou / )
pt: )e / ou / )

source: )and / or / )) / )or(
fr: )et / ou / )) / )ou(
pt: )e / ou / )) / )ou(

source: Select a Sd Statement:
fr: Choisir une déclaration
pt: Selecionar uma Declaração SD:
